{
  "backend/main.mo": "Defines an order actor with create, retrieve, update UPI reference, and list operations using a Map store.",
  "feature_evidence.json": "Feature evidence report mapping product features to corresponding frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme definitions for light/dark modes with base styling.",
  "frontend/index.html": "Root HTML file loading the React app entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for landing, checkout, order confirmation, and payment submitted pages wrapped in a forced-dark ThemeProvider.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying product info, support details, social links, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout with luxury dark background texture, top navigation, page outlet, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with branding and a Buy Now button that routes to checkout.",
  "frontend/src/components/orders/UPIReferenceForm.tsx": "Form for submitting a UPI transaction reference with validation and navigation on success.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Features section showing five product features with icons and reveal-on-scroll animations.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section displaying product name, price, a buy button, and an animated image with reveal and tilt effects.",
  "frontend/src/components/sections/OfferSection.tsx": "Offer section highlighting a discounted price with scroll reveal and a checkout button.",
  "frontend/src/components/sections/TrustSection.tsx": "Trust section showing reassurance badges like replacement and free shipping with scroll reveal animations.",
  "frontend/src/components/upi/UPIPaymentPanel.tsx": "UPI payment panel that generates a QR code and link for payment along with amount details.",
  "frontend/src/config/upi.ts": "Defines static UPI configuration including VPA, payee name, and transaction note.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity handling login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for creating orders, fetching orders, and submitting UPI references using the backend actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook that reveals an element when it becomes visible via IntersectionObserver.",
  "frontend/src/hooks/useTilt.ts": "Hook that applies a mouse-based tilt effect to an element unless reduced motion is preferred.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining the theme, colors, and layout behavior.",
  "frontend/src/lib/pricing.ts": "Exports product name, price, and a helper to calculate total cost by quantity.",
  "frontend/src/lib/upi.ts": "Builds a UPI payment URL using configured VPA, payee details, and order info.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout form with validation, quantity selection, total calculation, and order creation before navigating to the confirmation page.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main marketing landing page composed of hero, features, offer, and trust sections.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order details and conditionally shows UPI payment panel or payment reference after fetching order data.",
  "frontend/src/pages/PaymentSubmittedPage.tsx": "Shows payment submission confirmation with order ID, reference, and post-payment guidance.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the project’s dark luxury UI.",
  "project_state.json": "Stores project metadata, features, requirements, and image needs for the single‑product ecommerce site."
}