{
  "backend/main.mo": "Defines an order-management canister with creation, retrieval, listing, and UPI reference update functions.",
  "feature_evidence.json": "Feature evidence report describing a hero image path change request and associated metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color tokens, dark mode variables, and base styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router routes and wraps the app in a forced-dark ThemeProvider.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with product info, support details, social links, and Caffeine.ai attribution.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout providing the luxury background, navigation, routed content, and footer.",
  "frontend/src/components/layout/TopNav.tsx": "Top navigation bar with branding and a Buy Now button linking to checkout.",
  "frontend/src/components/orders/UPIReferenceForm.tsx": "Form for entering and submitting a UPI payment reference, with validation and navigation on success.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Displays five product features with icons and scroll-reveal animations.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner showing product name, price, CTA, and tilting product image using the centralized hero image source.",
  "frontend/src/components/sections/OfferSection.tsx": "Displays a promotional offer section with animated reveal, discounted pricing, and a checkout button.",
  "frontend/src/components/sections/TrustSection.tsx": "Shows trust badges with scroll animations highlighting replacement and free shipping policies.",
  "frontend/src/components/upi/UPIPaymentPanel.tsx": "Renders a UPI payment panel with QR code, payment link, and order amount details.",
  "frontend/src/config/upi.ts": "Defines static UPI configuration including VPA, payee name, and transaction note.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for creating orders, fetching orders, and submitting UPI reference numbers.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Implements an intersection-based hook to reveal elements when scrolled into view.",
  "frontend/src/hooks/useTilt.ts": "Adds mouse-based 3D tilt effects to an element unless reduced motion is preferred.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, base styles, and dark mode behavior.",
  "frontend/src/lib/pricing.ts": "Exports product constants and a helper to compute total price based on quantity.",
  "frontend/src/lib/upi.ts": "Generates a UPI payment link using configured merchant details and order information.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, validates input, creates orders, and navigates to the order page.",
  "frontend/src/pages/LandingPage.tsx": "Assembles the landing page by rendering hero, features, offer, and trust sections.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order details after checkout, shows UPI payment steps if no reference is provided, and confirms payment when a reference exists.",
  "frontend/src/pages/PaymentSubmittedPage.tsx": "Shows a confirmation message after a UPI reference is submitted and outlines next steps for verification and shipping.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, animations, and container settings for the site’s design system.",
  "project_state.json": "Tracks project metadata, requirements, features, and known issues for the ecommerce site build."
}