{
  "kind": "build_request",
  "title": "Restore the user-provided hero product photo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Update the landing page hero product photo to use the same user-provided image that was previously added (i.e., revert the current hero image change). Specifically, change the centralized hero image path constant (HERO_IMAGE_SRC in frontend/src/lib/pricing.ts) from the current file to the user-provided image file located in the static assets directory (frontend/public/assets/generated), and ensure the Hero section renders that image without any broken links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "you change photo please add same photo which i add"
        ]
      },
      "acceptanceCriteria": [
        "HERO_IMAGE_SRC in frontend/src/lib/pricing.ts no longer points to /assets/generated/product-hero-v2.dim_1600x1200.png and instead points to the user-provided image filename that exists under frontend/public/assets/generated.",
        "The Hero section image renders correctly on the landing page (no 404/missing image) and continues to use the centralized HERO_IMAGE_SRC constant (no hardcoded image path added to the component).",
        "No other landing page content, layout, or theme styling changes as part of this update."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited (per SYSTEM_CONTEXT).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Creating a new hero image or redesigning the landing page theme.",
    "Changing product name, pricing, checkout flow, or UPI configuration.",
    "Adding any backend changes or order-flow changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}